<?php
( defined( 'ABSPATH' ) ) || exit;

function subjects_art( $id = null ) {

    if ( ! is_null( $id ) && absint( $id ) == 0 ) {
        return "نا مشخص";
    }
    $array = array(

        "1" => "ایران آینده",
        "2" => "دوازده روز حماسه",
        "3" => "روایت آزادگی ملت‌ها",
        "4" => "روایت زیبایی‌های ایران",
        "5" => "شهر دوست‌داشتنی",
        "6" => "طنز اجتماعی",
        "7" => "محیط زیست",
        "8" => "هویت شهری",
        "9" => "سایر",

    );

    return $id ? $array[ $id ] : $array;
}
